Repository: miurahr/translate-django-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Try "/polls/34/results/" and "/polls/34/vote/" too -- these will display the placeholder results and voting pages.
ja: "/polls/34/results/" と "/polls/34/vote/" も試してください。結果と投票ページのプレースホルダがそれぞれ表示されます。

source: URLconfs also serve to decouple URLs from Python code.
ja: URLconf はまた、 URL と Python コードを脱カップ リングする働きも持っています。

source: Up to a certain point, 'checking that it seems to work' will be a satisfactory test.
ja: ある一定の基準まで、'動くであろうことを確認すること'が十分なテストでしょう。

source: Upload the package on your Web site.
ja: 自身の Web サイトにアップロードする

source: Using ``method="post"`` (as opposed to ``method="get"``) is very important, because the act of submitting this form will alter data server-side.
ja: ``method="post"`` を使用する (``method="get"`` ではなく) ことは非常に重要です。なぜなら、フォームの送信はサーバ側のデータの更新につながるからです。

source: Using parentheses around a pattern "captures" the text matched by that pattern and sends it as an argument to the view function; ``?P<question_id>`` defines the name that will be used to identify the matched pattern; and ``[0-9]+`` is a regular expression to match a sequence of digits (i.e., a number).
ja: パターンの前後に括弧を使用すると、そのパターンにマッチしたテキストを "キャプチャ" し、ビュー関数の引数として、それを送信します。 ``?P<question_id>`` はマッチしたパターンを識別するために使用する名前を定義します。 ``[0-9]+`` は一桁以上の数字(すなわち、数)にマッチする正規表現です。

source: Using your own package
ja: 自分のパッケージを使ってみる

source: Variables are surrounded by double-curly braces.
ja: 変数は、二重鉤括弧で囲みます。

source: Verifying
ja: 動作確認

source: Verifying your test now passes
ja: テストが通ることを確認する

source: Views
ja: ビュー

source: Vote action -- handles voting for a particular choice in a particular question.
ja: 投票ページ -- 特定の質問の選択を投票として受付

source: We also created a dummy implementation of the ``vote()`` function.
ja: すでに、 ``vote()`` 関数のダミー実装を作成しました。

source: We aren't going to use this feature of Django in the tutorial.
ja: この機能はチュートリアルでは使いません。

source: We can run the test suite by simply ``cd``-ing into the Django ``tests/`` directory and, if you're using GNU/Linux, Mac OS X or some other flavor of Unix, run::
ja: テストスイートの実行は Django の ``tests/`` ディレクトリに `cd`` で移動し、GNU/Linux, Mac OS X 等 Unix 系 OS を利用している場合は以下のコマンドを実行します::

source: We forgot to add the import for that method.
ja: メソッドで使うモジュールのインポートを忘れていました｡

source: We have a :doc:`complete installation guide </topics/install>` that covers all the possibilities; this guide will guide you to a simple, minimal installation that'll work while you walk through the introduction.
ja: Django にはできることをすべてカバーした :doc:`インストールガイド </topics/install>` があります。これはシンプルでミニマルなインストールガイドで、 Django の導入部分までが説明されています。

source: We set the form's ``action`` to ``{% url 'polls:vote' question.id %}``, and we set ``method="post"``.
ja: フォームの ``action`` を ``{% url 'polls:vote' question.id %}`` に設定し、 さらに、 ``method="post"`` を設定します。

source: We'll be walking you through contributing a patch to Django for the first time.
ja: 初めて Django にパッチを送る手順を詳しく解説します。

source: We'll give an example of this in a bit.
ja: 少し例を提示します。

source: We'll walk you through the entire process, so you can learn by example.
ja: 私達がプロセス全体を詳しく解説するので、その例から学ぶことができるでしょう。

source: We're continuing the Web-poll application and will focus on simple form processing and cutting down our code.
ja: ここでは、引続き Web 投票アプリケーションの開発を例にして、簡単なフォー ム処理とコードの縮小化を中心に解説します。

source: We're using this instead of simply typing "python", because :file:`manage.py` sets the ``DJANGO_SETTINGS_MODULE`` environment variable, which gives Django the Python import path to your :file:`mysite/settings.py` file.
ja: 単に “python” を実行しないのは、 Django に :file:`mysite/settings.py` ファイルへの import パスを与える ``DJANGO_SETTINGS_MODULE`` の環境変数を :file:`manage.py` で設定しているからです。

source: We've built a tested Web-poll application, and we'll now add a stylesheet and an image.
ja: Web 投票アプリケーションのテストが完成したので、今度はスタイルシートや画像を追加しましょう。

source: We've included this with Django so you can develop things rapidly, without having to deal with configuring a production server -- such as Apache -- until you're ready for production.
ja: Django 開発サーバは Python だけで書かれた軽量な Web サーバです。このサーバは、開発を迅速に行い、運用に適した状態になるまで Apache のような運用サーバの設定をいじらなくても良いようにするためのものです。

source: Well, you came to the right place: read this material to quickly get up and running.
ja: なら、ここに来て正解ですね。ここにあるドキュメントを読んで、行動に移してみましょう。

source: What are automated tests?
ja: 自動テストとは何ですか？

source: What does this tutorial cover?
ja: このチュートリアルの範囲はなんですか?

source: What's different in *automated* tests is that the testing work is done for you by the system.
ja: *自動* テストが他と異なる点は、テスト作業がシステムによって実行されることです。

source: What's next?
ja: 次は何をしましょうか？

source: When Django finds a regular expression match, Django calls the specified view function, with an :class:`~django.http.HttpRequest` object as the first argument and any “captured” values from the regular expression as other arguments.
ja: Django がマッチする正規表現を見つけると、 Django は所定のビュー関数を呼び出します。その際は :class:`~django.http.HttpRequest` オブジェクトを第一引数に、その他、正規表現から「キャプチャされた」値を他の引数に関数を呼び出します。

source: When a user requests a page, Django runs through each pattern, in order, and stops at the first one that matches the requested URL.
ja: ユーザがページを要求すると、 Django はそれぞれのパターンを順番にチェックし、要求された URL に最初に一致したパターンで停止します。

source: When contributing to Django it's very important that your code changes don't introduce bugs into other areas of Django.
ja: Django へ貢献する際、変更したコードが Django の他の領域にバグをの変更はDjangoの他の領域にバグを混入しないことが非常に重要です。

source: When developing against trunk, you can check `Django's continuous integration builds`__ to determine if the failures are specific to your machine or if they are also present in Django's official builds.
ja: トランクバージョンで開発を行う場合､ `Django の継続インテグレーションビルド`__ をチェックしてください。これで､テストの失敗があなたのマシンだけのものか､ Django 公式のビルドによるものかが分かります｡

source: When you're comfortable with the API, read :doc:`part 2 of this tutorial </intro/tutorial02>` to get Django's automatic admin working.
ja: API を使いこなせるようになったら、 :doc:`チュートリアルその2 </intro/tutorial02>` に進んで、 Django が自動生成する管理インタフェースを動かしてみましょう。

source: When you're comfortable with the admin site, read :doc:`part 3 of this tutorial </intro/tutorial03>` to start working on public poll views.
ja: admin サイトが満足すれば、 :doc:`チュートリアルその3 </intro/tutorial03>` に進んで、公開用の投票ビューを作りましょう。

source: When you're ready to start a project, you can :doc:`start with the tutorial </intro/tutorial01>` or :doc:`dive right into more detailed documentation </topics/index>`.
ja: (とはいえ、チュートリアルもリファレンスも別に用意していますよ！) プロジェクトを作成する準備ができたら、 :doc:`チュートリアルを始めれます </intro/tutorial01>` 。もしくは :doc:`より詳細なドキュメントを読む </topics/index>` こともできます。

source: Whenever you create a form that alters data server-side, use ``method="post"``.
ja: サーバ側のデータを更新するフォームを作成する場合は、 ``method="post"`` を使いましょう。

source: Where should this code live?
ja: コードはどこに置くの？

source: Where to get help:
ja: 困ったときは:

source: Where to look for more information.
ja: より多くの情報を得る方法

source: While Django's test suite is running, you'll see a stream of characters representing the status of each test as it's run.
ja: Django のテストスイートを実行中に、各テストの状態を文字の流れで確認することができます。

source: While successfully passing the entire test suite doesn't guarantee your code is bug free, it does help identify many bugs and regressions that might otherwise go unnoticed.
ja: すべてのテストが通るという事は､追加したコードがバグフリーだと保証します｡大量のバグや手戻りを発見できます｡そうでないとバグを見逃してしまうでしょう｡

source: Who's this tutorial for?
ja: このチュートリアルは誰を対象としていますか?

source: Why you need to create tests
ja: なぜテストを作成せねばならないのか

source: Wire these new views into the ``polls.urls`` module by adding the following :func:`~django.conf.urls.url` calls:
ja: 新しいviewを``polls.urls``に追加します。:func:`~django.conf.urls.url` 呼び出すview

source: With Django, you don't do that.
ja: Django ではそうしないでください｡

source: With that ``TabularInline`` (instead of ``StackedInline``), the related objects are displayed in a more compact, table-based format:
ja: ``StackedInline`` に変わって ``TabularInline`` を使うと、 リレーション相手のオブジェクトはよりコンパクトなテーブル形式で表示されます:

source: With that, you've got a free, and rich, :doc:`Python API </topics/db/queries>` to access your data.
ja: これだけで、制約のない充実した :doc:`Python API </topics/db/queries>` を使っ て自分のデータにアクセスできます。

source: Write a simple form
ja: 簡単なフォームを書く

source: Write views that actually do something
ja: 実際に動作するビューを書く

source: Write your first view
ja: はじめてのビュー作成

source: Write your views
ja: ビューの自作

source: Writing Documentation
ja: ドキュメントを書く

source: Writing a test for your patch.
ja: パッチへのテストを書く

source: Writing more views
ja: もっとビューを書いてみる

source: Writing some tests for ticket #17549
ja: チケット #17549 にテストを書いてみましょう

source: Writing some tests for your ticket
ja: チケットにテストを書く

source: Writing the code for ticket #17549
ja: チケット #17549 にコードを書く

source: Writing the code for your patch.
ja: パッチのコードを書く

source: Writing the code for your ticket
ja: チケットにコードを書く

source: Writing your first Django app, part 1
ja: はじめての Django アプリ作成、その 1

source: Writing your first Django app, part 2
ja: はじめての Django アプリ作成、その2

source: Writing your first Django app, part 3
ja: はじめての Django アプリ作成、その 3

source: Writing your first Django app, part 4
ja: はじめての Django アプリ作成、その 4

source: Writing your first Django app, part 5
ja: はじめての Django アプリ作成、その 5

source: Writing your first Django app, part 6
ja: はじめての Django アプリ作成、その 6

source: Writing your first patch for Django
ja: Django への初めてのパッチを書く

source: Year-based archive page -- displays all months with entries in the given year.
ja: 年ごとのアーカイブページ - 指定された年のエントリーの月を全て表示

source: Yet.
ja: 今はまだ。

source: You can chain together as many filters as you'd like.
ja: フィルターはいくつでも好きなだけ繋げることが出来ます。

source: You can click on the column headers to sort by those values -- except in the case of the ``was_published_recently`` header, because sorting by the output of an arbitrary method is not supported.
ja: カラムのヘッダをクリックすると、カラムの値に応じてエントリを並べ換えできます。ただし ``was_published_recently`` ヘッダは例外で、これはメソッドの戻り値を 使った並べ換えをサポートしていないからです。

source: You can make the change if you'd like, but we'll skip it for now in the interest of brevity.
ja: もしやりたいならやってもいいですが､ここでは省略します｡

source: You can then check out the older revision of Django that we'll be using in the tutorial below::
ja: 次にチュートリアルで使用する Django の旧リビジョンをチェックアウトします。

source: You can verify that Python is installed by typing ``python`` from your shell; you should see something like::
ja: Python がインストールされてるかを確かめるには ``python`` とシェルでタイプします。このように表示されるはずです::

source: You can write :doc:`custom template tags </howto/custom-template-tags>`, which run custom Python code behind the scenes.
ja: :doc:`カスタムテンプレートタグ</howto/custom-template-tags>` を書くことも出来ます。

source: You can write :ref:`custom template filters <howto-writing-custom-template-filters>`.
ja: また、独自の Python コードを実行する :ref:`カスタムテンプレートフィルタ <howto-writing-custom-template-filters>` や

source: You create a set of tests once, and then as you make changes to your app, you can check that your code still works as you originally intended, without having to perform time consuming manual testing.
ja: 一度テストセットを作成すると、それからはアプリに変更を加えるたびに、あなたの意図した通りにコードが動作するか確認できます。手動でテストする時間がかかることはありません。

source: You may have another version of Django installed.
ja: 別バージョンの Django がインストールされてるかもしれません。

source: You may want to make significant changes to the layout.
ja: レイアウトに何か重要な変更をしたいかも知れません。

source: You might encounter new bugs in the development version, but reporting them helps the development of Django.
ja: そのかわり、開発版では新規バグに当たることもあるでしょうが、報告することで、Djangoの開発を応援することにつながります。

source: You should make sure to read Django's documentation on :doc:`claiming tickets and submitting patches </internals/contributing/writing-code/submitting-patches>`.
ja: Django のドキュメントの `チケットをクレームして､パッチを送信する </internals/contributing/writing-code/submitting-patches>`_ を読んでください｡

source: You should now have a file in the root Django directory called ``17549.diff``.
ja: Django のルートディレクトリに ``17549.diff`` というファイルが作られるでしょう｡

source: You should see the Django admin index page:
ja: 以下のような admin の一覧画面が表示されるはずです:

source: You should see the admin's login screen:
ja: 以下のような admin のログイ ン画面が表示されるはずです:

source: You should still see 3 failures with the following exception::
ja: 以下のように3つテストが落ちています::

source: You will be asked to enter your password twice, the second time as a confirmation of the first.
ja: パスワードは２回入力するように求められ、２回めが１回めと同じか、確認されます。

source: You will then be prompted for your desired email address:
ja: 電子メールアドレスを入力するように促されますので、入力してください：

source: You won't be able to run multiple versions of this package (or others with the same name).
ja: このパッケージの複数バージョン (もしくは同じ名前の別のもの) を実行できません

source: You'll follow this pattern -- create a model admin object, then pass it as the second argument to ``admin.site.register()`` -- any time you need to change the admin options for an object.
ja: このように、 admin のオプションを変更したいときには、モデルごとに admin オブジェクトを生成して、 ``admin.site.register()`` の 2 番目の引数に渡すと いうパターンに従ってください。

source: You'll see a "Welcome to Django" page, in pleasant, light-blue pastel.
ja: “Welcome to Django” と表示された、明るいパステル調のライトブルーのページが出るはずです。

source: You'll see a page listing all changes made to this object via the Django admin, with the timestamp and username of the person who made the change:
ja: ユーザが管理サイト上でオブジェクトに対して行った変更履歴の全てを、変更時刻と変更を行ったユーザ名付きでリストにしたページが表示されます:

source: You'll want to either switch to the older tutorial or the newer Django version.
ja: 古いチュートリアルを参照するか、新しいバージョンの Django を入手してください。

source: You've got three easy options to install Django:
ja: Django をインストールするには 3 つの方法があります:

source: You've started the Django development server, a lightweight Web server written purely in Python.
ja: これで、 Django 開発サーバを起動しました。

source: Your project and your reusable app
ja: プロジェクトと再利用可能アプリ

source: Your view can read records from a database, or not.
ja: ビューはデータベースからレコードを読みだしても、読み出さなくてもかまいません。

source: ``E`` indicates that an error was raised during a test, and ``F`` indicates that a test's assertions failed.
ja: ``E`` はテストにエラーが発生したことを表し、 ``F`` はテストのアサーションが失敗したことを表しています。

source: ``forloop.counter`` indicates how many times the :ttag:`for` tag has gone through its loop
ja: ``forloop.counter`` は、ttag:`for` タグのループが何度実行されたかを表す値です。

source: ``virtualenv`` puts your copy of Django on the ``PYTHONPATH`` automatically.
ja: ``virtualenv`` が自動的に Django を ``PYTHONPATH`` 上に追加します。

source: ``{{ article.headline }}`` means "Output the value of the article's headline attribute." But dots aren't used only for attribute lookup.
ja: ``{{ article.headline }}`` は、「articleのheadline属性を出力せよ」という意味になります。しかし、ドットは属性参照に限らず使われます。

source: then you're probably using a version of Django that doesn't match this tutorial version.
ja: おそらくこのチュートリアルのバージョンとは違う Django のバージョンを 使用していることでしょう。

source: There are a few exceptions to this stability and backwards-compatibility promise.
ja: この安定性と広報互換性には、例外があります。
